{"char_to_idx": {"\n": 0, " ": 1, "!": 2, "\"": 3, "#": 4, "$": 5, "%": 6, "&": 7, "'": 8, "(": 9, ")": 10, "+": 11, ",": 12, "-": 13, ".": 14, "/": 15, "0": 16, "1": 17, "2": 18, "3": 19, "4": 20, "5": 21, "6": 22, "7": 23, "8": 24, "9": 25, ":": 26, ";": 27, "<": 28, ">": 29, "?": 30, "@": 31, "A": 32, "B": 33, "C": 34, "D": 35, "E": 36, "F": 37, "G": 38, "H": 39, "I": 40, "J": 41, "K": 42, "L": 43, "M": 44, "N": 45, "O": 46, "P": 47, "Q": 48, "R": 49, "S": 50, "T": 51, "U": 52, "V": 53, "W": 54, "X": 55, "Y": 56, "Z": 57, "[": 58, "]": 59, "a": 60, "b": 61, "c": 62, "d": 63, "e": 64, "f": 65, "g": 66, "h": 67, "i": 68, "j": 69, "k": 70, "l": 71, "m": 72, "n": 73, "o": 74, "p": 75, "q": 76, "r": 77, "s": 78, "t": 79, "u": 80, "v": 81, "w": 82, "x": 83, "y": 84, "z": 85, "{": 86, "|": 87, "\u00a1": 88, "\u00a3": 89, "\u00b0": 90, "\u00bf": 91, "\u00c8": 92, "\u00e0": 93, "\u00e1": 94, "\u00e2": 95, "\u00e3": 96, "\u00e4": 97, "\u00e7": 98, "\u00e8": 99, "\u00e9": 100, "\u00ea": 101, "\u00ed": 102, "\u00ef": 103, "\u00f1": 104, "\u00f3": 105, "\u00f6": 106, "\u00f9": 107, "\u0328": 108, "\u03a7": 109, "\u03ac": 110, "\u03b3": 111, "\u03bd": 112, "\u03bf": 113, "\u03c1": 114, "\u03c2": 115, "\u03c6": 116, "\u03cc": 117, "\u03e5": 118, "\u2013": 119, "\u2014": 120, "\u2015": 121, "\u2018": 122, "\u2019": 123, "\u201c": 124, "\u201d": 125, "\u2026": 126, "\u2122": 127, "\u2c81": 128, "\u2c83": 129, "\u2c9b": 130, "\u2ca5": 131, "\u2cb1": 132, "\u300c": 133, "\u300d": 134, "\u3046": 135, "\u304d": 136, "\u3051": 137, "\u3052": 138, "\u3053": 139, "\u305a": 140, "\u305d": 141, "\u305f": 142, "\u306a": 143, "\u306e": 144, "\u306f": 145, "\u3078": 146, "\u3088": 147, "\u3089": 148, "\u308b": 149, "\u30ab": 150, "\u30af": 151, "\u30d1": 152, "\u30d9": 153, "\u30ea": 154, "\u30fc": 155, "\u4eba": 156, "\u5165": 157, "\u5510": 158, "\u60c5": 159, "\u63da": 160, "\u70ba": 161, "\u713c": 162, "\uff01": 163}, "idx_to_char": {"0": "\n", "1": " ", "2": "!", "3": "\"", "4": "#", "5": "$", "6": "%", "7": "&", "8": "'", "9": "(", "10": ")", "11": "+", "12": ",", "13": "-", "14": ".", "15": "/", "16": "0", "17": "1", "18": "2", "19": "3", "20": "4", "21": "5", "22": "6", "23": "7", "24": "8", "25": "9", "26": ":", "27": ";", "28": "<", "29": ">", "30": "?", "31": "@", "32": "A", "33": "B", "34": "C", "35": "D", "36": "E", "37": "F", "38": "G", "39": "H", "40": "I", "41": "J", "42": "K", "43": "L", "44": "M", "45": "N", "46": "O", "47": "P", "48": "Q", "49": "R", "50": "S", "51": "T", "52": "U", "53": "V", "54": "W", "55": "X", "56": "Y", "57": "Z", "58": "[", "59": "]", "60": "a", "61": "b", "62": "c", "63": "d", "64": "e", "65": "f", "66": "g", "67": "h", "68": "i", "69": "j", "70": "k", "71": "l", "72": "m", "73": "n", "74": "o", "75": "p", "76": "q", "77": "r", "78": "s", "79": "t", "80": "u", "81": "v", "82": "w", "83": "x", "84": "y", "85": "z", "86": "{", "87": "|", "88": "\u00a1", "89": "\u00a3", "90": "\u00b0", "91": "\u00bf", "92": "\u00c8", "93": "\u00e0", "94": "\u00e1", "95": "\u00e2", "96": "\u00e3", "97": "\u00e4", "98": "\u00e7", "99": "\u00e8", "100": "\u00e9", "101": "\u00ea", "102": "\u00ed", "103": "\u00ef", "104": "\u00f1", "105": "\u00f3", "106": "\u00f6", "107": "\u00f9", "108": "\u0328", "109": "\u03a7", "110": "\u03ac", "111": "\u03b3", "112": "\u03bd", "113": "\u03bf", "114": "\u03c1", "115": "\u03c2", "116": "\u03c6", "117": "\u03cc", "118": "\u03e5", "119": "\u2013", "120": "\u2014", "121": "\u2015", "122": "\u2018", "123": "\u2019", "124": "\u201c", "125": "\u201d", "126": "\u2026", "127": "\u2122", "128": "\u2c81", "129": "\u2c83", "130": "\u2c9b", "131": "\u2ca5", "132": "\u2cb1", "133": "\u300c", "134": "\u300d", "135": "\u3046", "136": "\u304d", "137": "\u3051", "138": "\u3052", "139": "\u3053", "140": "\u305a", "141": "\u305d", "142": "\u305f", "143": "\u306a", "144": "\u306e", "145": "\u306f", "146": "\u3078", "147": "\u3088", "148": "\u3089", "149": "\u308b", "150": "\u30ab", "151": "\u30af", "152": "\u30d1", "153": "\u30d9", "154": "\u30ea", "155": "\u30fc", "156": "\u4eba", "157": "\u5165", "158": "\u5510", "159": "\u60c5", "160": "\u63da", "161": "\u70ba", "162": "\u713c", "163": "\uff01"}, "vocab_size": 164, "seq_length": 256}